MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFG064/mcu.h
#define _OFF060_VOFF_POSITION                    0x00000001
#define _OFF060_VOFF_MASK                        0x0003FFFE
#define _OFF060_VOFF_LENGTH                      0x00000011

#define _OFF061_VOFF_POSITION                    0x00000001
#define _OFF061_VOFF_MASK                        0x0003FFFE
#define _OFF061_VOFF_LENGTH                      0x00000011

#define _OFF062_VOFF_POSITION                    0x00000001
#define _OFF062_VOFF_MASK                        0x0003FFFE
#define _OFF062_VOFF_LENGTH                      0x00000011

#define _OFF063_VOFF_POSITION                    0x00000001
#define _OFF063_VOFF_MASK                        0x0003FFFE
#define _OFF063_VOFF_LENGTH                      0x00000011

#define _OFF064_VOFF_POSITION                    0x00000001
#define _OFF064_VOFF_MASK                        0x0003FFFE
#define _OFF064_VOFF_LENGTH                      0x00000011

#define _OFF065_VOFF_POSITION                    0x00000001
#define _OFF065_VOFF_MASK                        0x0003FFFE
#define _OFF065_VOFF_LENGTH                      0x00000011

#define _OFF066_VOFF_POSITION                    0x00000001
#define _OFF066_VOFF_MASK                        0x0003FFFE
#define _OFF066_VOFF_LENGTH                      0x00000011

#define _OFF067_VOFF_POSITION                    0x00000001
#define _OFF067_VOFF_MASK                        0x0003FFFE
#define _OFF067_VOFF_LENGTH                      0x00000011

#define _OFF068_VOFF_POSITION                    0x00000001
#define _OFF068_VOFF_MASK                        0x0003FFFE
#define _OFF068_VOFF_LENGTH                      0x00000011

#define _OFF069_VOFF_POSITION                    0x00000001
#define _OFF069_VOFF_MASK                        0x0003FFFE
#define _OFF069_VOFF_LENGTH                      0x00000011

#define _OFF070_VOFF_POSITION                    0x00000001
#define _OFF070_VOFF_MASK                        0x0003FFFE
#define _OFF070_VOFF_LENGTH                      0x00000011

#define _OFF071_VOFF_POSITION                    0x00000001
#define _OFF071_VOFF_MASK                        0x0003FFFE
#define _OFF071_VOFF_LENGTH                      0x00000011

#define _OFF072_VOFF_POSITION                    0x00000001
#define _OFF072_VOFF_MASK                        0x0003FFFE
#define _OFF072_VOFF_LENGTH                      0x00000011

#define _OFF073_VOFF_POSITION                    0x00000001
#define _OFF073_VOFF_MASK                        0x0003FFFE
#define _OFF073_VOFF_LENGTH                      0x00000011

#define _OFF074_VOFF_POSITION                    0x00000001
#define _OFF074_VOFF_MASK                        0x0003FFFE
#define _OFF074_VOFF_LENGTH                      0x00000011

#define _OFF075_VOFF_POSITION                    0x00000001
#define _OFF075_VOFF_MASK                        0x0003FFFE
#define _OFF075_VOFF_LENGTH                      0x00000011

#define _OFF076_VOFF_POSITION                    0x00000001
#define _OFF076_VOFF_MASK                        0x0003FFFE
#define _OFF076_VOFF_LENGTH                      0x00000011

#define _OFF077_VOFF_POSITION                    0x00000001
#define _OFF077_VOFF_MASK                        0x0003FFFE
#define _OFF077_VOFF_LENGTH                      0x00000011

#define _OFF102_VOFF_POSITION                    0x00000001
#define _OFF102_VOFF_MASK                        0x0003FFFE
#define _OFF102_VOFF_LENGTH                      0x00000011

#define _OFF103_VOFF_POSITION                    0x00000001
#define _OFF103_VOFF_MASK                        0x0003FFFE
#define _OFF103_VOFF_LENGTH                      0x00000011

#define _OFF104_VOFF_POSITION                    0x00000001
#define _OFF104_VOFF_MASK                        0x0003FFFE
#define _OFF104_VOFF_LENGTH                      0x00000011

#define _OFF105_VOFF_POSITION                    0x00000001
#define _OFF105_VOFF_MASK                        0x0003FFFE
#define _OFF105_VOFF_LENGTH                      0x00000011

#define _OFF106_VOFF_POSITION                    0x00000001
#define _OFF106_VOFF_MASK                        0x0003FFFE
#define _OFF106_VOFF_LENGTH                      0x00000011

#define _OFF109_VOFF_POSITION                    0x00000001
#define _OFF109_VOFF_MASK                        0x0003FFFE
#define _OFF109_VOFF_LENGTH                      0x00000011

#define _OFF110_VOFF_POSITION                    0x00000001
#define _OFF110_VOFF_MASK                        0x0003FFFE
#define _OFF110_VOFF_LENGTH                      0x00000011

#define _OFF111_VOFF_POSITION                    0x00000001
#define _OFF111_VOFF_MASK                        0x0003FFFE
#define _OFF111_VOFF_LENGTH                      0x00000011

#define _OFF112_VOFF_POSITION                    0x00000001
#define _OFF112_VOFF_MASK                        0x0003FFFE
#define _OFF112_VOFF_LENGTH                      0x00000011

#define _OFF113_VOFF_POSITION                    0x00000001
#define _OFF113_VOFF_MASK                        0x0003FFFE
#define _OFF113_VOFF_LENGTH                      0x00000011

#define _OFF114_VOFF_POSITION                    0x00000001
#define _OFF114_VOFF_MASK                        0x0003FFFE
#define _OFF114_VOFF_LENGTH                      0x00000011

#define _OFF115_VOFF_POSITION                    0x00000001
#define _OFF115_VOFF_MASK                        0x0003FFFE
#define _OFF115_VOFF_LENGTH                      0x00000011

#define _OFF116_VOFF_POSITION                    0x00000001
#define _OFF116_VOFF_MASK                        0x0003FFFE
#define _OFF116_VOFF_LENGTH                      0x00000011

#define _OFF117_VOFF_POSITION                    0x00000001
#define _OFF117_VOFF_MASK                        0x0003FFFE
#define _OFF117_VOFF_LENGTH                      0x00000011

#define _OFF119_VOFF_POSITION                    0x00000001
#define _OFF119_VOFF_MASK                        0x0003FFFE
#define _OFF119_VOFF_LENGTH                      0x00000011

#define _OFF120_VOFF_POSITION                    0x00000001
#define _OFF120_VOFF_MASK                        0x0003FFFE
#define _OFF120_VOFF_LENGTH                      0x00000011

